// ──────────────────────────────────
// ─────────▄██████████████████▄─────
// ────────██▀░░░░░░░░░░░░░░░░▀██▄───
// ───────█▌░░▄░░░░░░░▀▄▄▀░░░░░░▀█───
// ──────█▌░░░▀███▄░░▀▄▄▄▄▀░░░░░░▀█──
// ─────█▌░░░░█▀──▀▄░░░░░░░░░▄▄█▀░▐█─
// ────█▌░░░░░█─────█░▄▄▄░░▄▀▀▀▀▄░░▐█
// ───█▌░░░░░░█──█──█░░░░░█─────█░░░█
// ──█▌░░░░░░░░▀▄▄▄▀░░░░░░█──█──█░░░█
// ─█▌░░░░░░░░░░░░░░▄░░▄░░░▀▄▄▄▀░░░░█
// █▌░░░░▄▀▀▄░░░░░▀▀░░░░▀▀░░░░░░░░░░█
// █░░░░░▀▄░░░░░░░▄▀░▀▄░░░░░▄▀▀▄░░░░█
// █░▐░░░░░▀▀▀▀▀▀▀░░░░░▀▀▄▄▄▄▄▄▀░░▌░█
// █░░▌▄░░░░░░▄█▀▀█▀▀█▀▄░░░░░░░▄░▐░░█
// █░░▌█▀█▀▀█▀─█──█──█──█▀▀█▀▀██░▐░░█
// █░▐░█▄█▄▄█▄▄█▄▄█▄▄█▄▄█▄▄█▄██░░▐░░█
// █░░░███████████████████████░░░░▌░█
// █░░░█▄─█──█──█──█──█──█──█▀░░░░░░█
// █░░░░▀██▄▄█▄▄█▄▄█▄▄█▄▄█▄█▀░░░░░░▐█
// █▌░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄█▀
// ─█▄░░░░░░░░░░░░░░░░░░░░░░░░░░░▄█──
// ──█▄░░░░░░░▀▄▄▄▄▄▄▄▀░░░░░░░░░▄█───
// ───██▄░░░░░░░░░░░░░░░░░░░░░▄██────
// ────▀██▄░░░░░░░░░░░░░░░░░▄██▀─────
// ──────▀███████████████████▀───────
// ===========================================================================
// guard: Колян. Сторожит программы, смотрит за junk. Чертёж №17.
// ===========================================================================
use ::util::check;
use ::junk::guard as next;

pub const IMYA: &'static str = "Колян";
pub const ROKOVOE: u32 = 66;

pub fn files() -> Vec<(&'static str, &'static str)> {
    vec![
        ("apps/mod.rs", include_str!("mod.rs")),
        ("apps/hello.asm", include_str!("hello.asm")),
        ("apps/hello.c", include_str!("hello.c")),
        ("apps/quine.c", include_str!("quine.c")),
        ("apps/quine.lua", include_str!("quine.lua")),
        ("apps/chess.c", include_str!("chess.c")),
        ("apps/selftest.asm", include_str!("selftest.asm")),
        ("apps/player.asm", include_str!("player.asm")),
        ("apps/guard.rs", include_str!("guard.rs")),
    ]
}

pub const SUMMA: u32 = 0x8666757a; // СУММА: 0x8666757a

pub fn summa() -> u32 { check::zone_sum(&files(), 1) }
pub fn check_own() -> bool {
    check::zone_ok(&files(), 1, SUMMA) && check::mood_ok(&files())
}
/// Колян смотрит за Жориком. Жорик сторожит мусор и не жалуется.
pub fn check() -> bool { check_own() && next::check_own() }
